* Prejam / Engine Creation
  The rules state
  #+begin_quote
  General purpose code, designing, bases and models,
  placeholders, and story can be made before the start of the
  jam. Here's clarification
  #+end_quote
  (https://corgi-engine.moremountains.com/, apparently this qualifies, and this is practically a game on it's own...)

  This is general purpose enough since I just need it for any open-world metroidvania. Design
  will be done outside repo maybe?

  I'm not expecting to target the web unlike with other gamejams since most metroidvanias ought to
  be long enough that I shouldn't be able to play through them in an average browser session ya know?

  I mean I'm using SDL2 so I guess I have that choice if I want
  
** <2022-01-19 Wed>
*** DONE Sprite rendering,
    :LOGBOOK:
    CLOCK: [2022-01-19 Wed 15:05]--[2022-01-19 Wed 15:26] =>  0:21
    :END:
*** DONE Text rendering (preferably sizing!),
    :LOGBOOK:
    CLOCK: [2022-01-19 Wed 15:31]--[2022-01-19 Wed 15:55] =>  0:24
    :END:
*** DONE Input from keyboard
    :LOGBOOK:
    CLOCK: [2022-01-19 Wed 16:40]--[2022-01-19 Wed 16:53] =>  0:13
    :END:
*** DONE Input from mouse
*** DONE Basic platforming (collision, and physics),
    :LOGBOOK:
    CLOCK: [2022-01-19 Wed 17:25]--[2022-01-19 Wed 18:25] =>  1:00
    :END:
*** DONE Wobbly camera (smooth lerp, and juicing shakes),
*** DONE Come up with tomorrow's tasklist for generic engine ness
** <2022-01-20 Thu>
   Dental appointment so I'll be late, day 2, more basic stuff, just do
   most of the stuff on the list. 25 or so days?

   NOTE(jerry): appointment at 3:10 and I have to stick around until 4:20 for the
   second one? What was that I said about getting anything done?? hahaha

   Actually ya know what. I'm not doin this today.
** <2022-01-21 Fri>
*** TODO (this)Input from controller
*** TODO (this)Basic sound effects
    sdl mixer is passable enough. not good at audio
*** TODO (this)Subrectangle sprite rendering
*** TODO (this)Tile world universe
    no editor yet.
    If I'm genuinely lazy, I could just used tiled but lets not.
*** TODO (this)One sided tiles
*** TODO (this)Tile slopes
*** TODO (this)Tile stairs
*** TODO (??) Tile world editor
    This will eventually be expanded to a world link editor.
    I'll have to code in specific functionality per game, but this is generally
    pretty generic stuff, so should be fair game since there's no assets. I could use
    this to prototype world layout I guess...
*** TODO (reallybasicthis)particle systems that can collide and bounce
    Looks kind of cool I guess, not necessarily interactive.
*** TODO Try to build on ubuntu or something
    someone teach me how to distribute on linux, I'll provide source anyways but
    senpai pls.
*** TODO Rope like objects (this is definitely not possible without custom rendering lol)
    Oh no bad pixel art engage... Is this really worth it considering what I have to draw?
    uh...... Well, if I need it... I'll have it I guess.
*** TODO Basic debug gui stuff
*** TODO (maybe think, but no code?)Consider thinking of the entity system
*** TODO maybe refactor stuff?
*** TODO (tomorrow, (finish over weekend))Start OpenGL renderer as the last thing I guess.

* Jam Time
  When the jam starts put tasks here. This is game-specific stuff,
  hopefully by this time I have a plan for the game plot and obviously
  the engine should be ready by this time (or good enough...)
